---
kind: method
id: M:Autodesk.Revit.DB.FormattedText.SetUnderlineStatus(System.Boolean)
source: html/01c61fb6-104d-d594-0365-b493bb0165b5.htm
---
# Autodesk.Revit.DB.FormattedText.SetUnderlineStatus Method

Sets the characters in the entire text to be underlined or not underlined.

## Syntax (C#)
```csharp
public void SetUnderlineStatus(
	bool isUnderlined
)
```

## Parameters
- **isUnderlined** (`System.Boolean`) - The desired underline status of characters in the entire text.
 True to set underlined, false to set not underlined.